Revit 2027 API
IExtElemChangeBeamSection Methods
The IExtElemChangeBeamSection type exposes the following members.
Methods
Name | Description
ChangeSection |  The method that will be called when user wants to change beam section
Top
See Also
Reference
IExtElemChangeBeamSection Interface
Autodesk.Revit.DB.Structure Namespace